// -------------------------------------------------------------------------------------------------
// 2013-08-26  Кода ошибок для компонент RSTools

#ifndef _ERRCODET_H_
#define _ERRCODET_H_


// -----------------------------------------------------------------------------
// Ошибки bedit (ERRC_RSTB_)

// -----------------------------------------------------------------------------
// Ошибки panel (ERRC_RSTP_)


// -----------------------------------------------------------------------------
// Ошибки tools (ERRC_RSTT_)

#define  ERRC_RSTT_InitEWCommon       110  // Ошибка инициализации EW-режима
#define  ERRC_RSTT_InitEWBadAnswer    111  // Ошибка инициализации EW-режима - некорректный размер ответа

#endif // _ERRCODET_H_

/* <-- EOF --> */