// -------------------------------------------------------------------------------------------------
// 2013-11-14  Новый механизм справочной системы
//             Интерфейс работы с файлом help_src.dbt

#ifndef _RSHELPSRCI_H_
#define _RSHELPSRCI_H_

#include "RSHelpSrc.h"

// -------------------------------------------------------------------------------------------------
_RSRESEXP int RSH_RunSourceScroll();

// -------------------------------------------------------------------------------------------------
_RSRESEXP int RSH_RunChmScroll();

// -------------------------------------------------------------------------------------------------
int RSH_RunSourceLister(int sourceType, THELP_SRC *buff);

// -------------------------------------------------------------------------------------------------
int RSH_RunChmLister(int sourceType, THELP_SRC *buff);

#endif // _RSHELPSRCI_H_

/* <-- EOF --> */