// -------------------------------------------------------------------------------------------------
// 2013-11-18  Новый механизм справочной системы
//             Меню

#ifndef _RSHELPMENU_H_
#define _RSHELPMENU_H_

#include "menu.h"


// -----------------------------------------------------------------------------
// Все интерфейсные функции работы с меню возвращают значение ENTER в случае
// выбора пункта меню, и значение ESC если меню было закрыто без выбора.

// -----------------------------------------------------------------------------
// Конвертация флагов панели (p->flags, типы вида P_) в RES_ - типы.
int RSH_CvtTypeToResType(int flags);

// -----------------------------------------------------------------------------
// Меню выбора вида записи
int RSH_SelectRecordType(int32 *id, char *name = NULL);

// -----------------------------------------------------------------------------
// Меню выбора вида источника
int RSH_SelectSourceType(int *id, char *code = NULL, char *name = NULL, bool truncAll = false);

// -----------------------------------------------------------------------------
// Меню выбора вида ресурса
// [out] id   - идентификатор типа (RES_)
// [out] code - код типа (_RSH_STR_SelectResType_Code)
// [out] name - наименование типа (_RSH_STR_SelectResType_Name)
_RSRESEXP int RSH_SelectResType(int32 *id, char *code = NULL, char *name = NULL);


// -----------------------------------------------------------------------------
// Все GET-функции работы с меню возвращают либо 0 в случае успеха, либо код
// ошибки. При этом в поле code/name записывается строка вида "?" или "???".

// -----------------------------------------------------------------------------
// Получить название вида записи
int RSH_GetRecordType(int32 id, char *name = NULL);

// -----------------------------------------------------------------------------
// Получить код и название вида источника
int RSH_GetSourceType(int32 *id, char *code = NULL, char *name = NULL);

// -----------------------------------------------------------------------------
// Получить код и название вида ресурса по идентификатору, или
// идентификатор и название вида ресурса по коду.
// [in,out] id   - идентификатор типа (RES_)
// [in,out] code - код типа (_RSH_STR_SelectResType_Code)
// [out]    name - наименование типа (_RSH_STR_SelectResType_Name)
_RSRESEXP int RSH_GetResType(int32 *id, char *code = NULL, char *name = NULL);


// -----------------------------------------------------------------------------
// Конвертация номера пункта меню в идентификатор ресурса
// При ошибке возвращает -1
// [in] n - номер пункта меню (от 0)
int32 RSH_CvtNtoID(int n);

// -----------------------------------------------------------------------------
// Конвертация идентификатора ресурса в номер пункта меню
// При ошибке возвращает -1
// [in] - идентификатор типа (RES_)
int32 RSH_CvtIDtoN(int id);

#endif // _RSHELPMENU_H_

/* <-- EOF --> */