// -------------------------------------------------------------------------------------------------
// 2013-11-14  Новый механизм справочной системы
//             Интерфейс работы с файлом help_fls.dbt

#ifndef _RSHELPFLSI_H_
#define _RSHELPFLSI_H_

//------------------------------------------------------------------------------
_RSRESEXP int RSH_RunObjAllScroll();

//------------------------------------------------------------------------------
_RSRESEXP int RSH_RunObjLbrScroll();

//------------------------------------------------------------------------------
_RSRESEXP int RSH_RunObjMsgScroll();

// -----------------------------------------------------------------------------
_RSRESEXP int RSH_RunObjIstScroll();

#endif // _RSHELPFLSI_H_

/* <-- EOF --> */