// -------------------------------------------------------------------------------------------------
// 2013-05-16  Утилитные функции для работы со строками

#ifndef _RSUTILSTR_H_
#define _RSUTILSTR_H_

#include <string>


// -----------------------------------------------------------------------------
namespace RSUSTR
        {
         // --------------------------------------------------------------------
         // Удаляем пробелы (именно пробелы !) в начале и в конце строки
         // [in,out] str - обрабатываемая строка
         // [ret]        - возвращает указатель на первый непробельный символ строки
         char *TrimSpaces(char *str);
        };

#endif _RSUTILSTR_H_

/* <-- EOF --> */