/*************************************************************************
   File Name      : vcs.h
   Programmer     : Alexey Lebedev

   Creation       : 05 Nov 2002
   Description    : 

   Copyright(C) 2002 by R-Style Software Lab.
   All Rights Reserved.

*************************************************************************/

#ifndef __VCS_H
#define __VCS_H

#include "unixio.h"


#define  VCS_DONTGET      0x000001   // Не копировать файл на терминал
#define  VCS_REPLACE      0x000002   // Обновлять файл на терминале без запроса

#define  VCS_FROMEM       0x000004   // Вызов от RSEM

#define  VCS_KEEPCHECKED  0x000100   // Сохранить CheckOut
#define  VCS_REMOVE       0x000200   // Удалять файл на терминале после CheckIn

#define  VCS_LEAVE        0x010000   // Оставить файл на терминале без изменений
#define  VCS_DELETE       0x020000   // Удалить файл на терминале после UndoCheckOut


#ifdef __cplusplus
extern "C" {
#endif


/******************************************************************************
******************************************************************************/
bool InitVCS(void);
void DoneVCS(void);


/******************************************************************************
   RslLockFile - блокирова файла
   RslUnlockFile - снять блокировку
******************************************************************************/
bool RslLockFile(const char *szFileName);
bool RslUnlockFile(const char *szFileName);


/******************************************************************************
   Найти хэндл открытого файла
******************************************************************************/
int RslFindHandle(const char *szFileName);


/******************************************************************************
   Изменить время модификации файла
******************************************************************************/
int RslSetFileTime(const char *szFileName, rstimebuf *timebuf);


/******************************************************************************
   Взять файл на редактирование
   Параметры:
      szLocalFile - имя файла на терминале или NULL
      szTargetFile- имя файла на сервере или NULL, если szLocalFile !NULL
      Flags       - VCS_DONTGET | VCS_REPLACE
   Возвращает полный путь к файлу на терминале или NULL.
******************************************************************************/

const char *CheckOutFile(const char *szLocalFile, const char *szTargetFile, long Flags);


/******************************************************************************
   Закончить редактирование файла, ранее взятого на редактирование
   Параметры:
      szLocalFile - имя файла на терминале, полученное от CheckOut.
      Flags       - VCS_KEEPCHECKED ^ VCS_REMOVE
******************************************************************************/
bool CheckInFile(const char *szLocalFile, long Flags);


/******************************************************************************
   Отменить редактирование файла, ранее взятого на редактирование
   Параметры:
      szLocalFile - имя файла на терминале, полученное от CheckOut.
      Flags       - VCS_LEAVE | VCS_DELETE
******************************************************************************/
bool UndoCheckOutFile(const char *szLocalFile, long Flags);


/******************************************************************************
   Получить полный путь к файлу на сервере
   Параметры:
      szLocalFile - имя файла на терминале, полученное от CheckOut.
      bStatus     - текущее состояние файла; равен true, если файл взят на редактирование
   Возвращает полный путь к файлу на сервере или NULL.
******************************************************************************/
const char *GetTargetFile(const char *szLocalFile, bool *bStatus);


/******************************************************************************
   Получить полный путь к файлу на терминале
   Параметры:
      szLocalFile - имя файла на терминале, полученное от CheckOut.
      bStatus     - текущее состояние файла; равен true, если файл взят на редактирование
   Возвращает полный путь к файлу на сервере или NULL.
******************************************************************************/
const char *GetLocalFile(const char *szTargetFile, bool *bStatus);


/******************************************************************************
   Скопировать файл с терминала на сервер
   Параметры:
      szLocalFile - имя файла на терминале
      szTargetFile- имя файла на сервере
   Возвращает полный путь к файлу на сервере или NULL.
******************************************************************************/
const char* CopyFileToServer(const char *szLocalFile, const char *szTargetFile);


/******************************************************************************
   Скопировать файл с сервера на терминал
   Параметры:
      szLocalFile - имя файла на терминале
      szTargetFile- имя файла на сервере
   Возвращает полный путь к файлу на терминале или NULL.
******************************************************************************/
const char *CopyFileFromServer(const char *szLocalFile, const char *szTargetFile);

#ifdef __cplusplus
};
#endif

#endif // __VCS_H

/* <-- EOF --> */